TEXTS: dict = {
    # Команды:
    'start_command': 'Запустить бота / Перезапустить',
    'help_command': 'Справка по работе бота',

    # Кнопки:
    'home': '🏠 Главное меню',
    'back': '⬅️ Назад',
    'useful_btn': '👍 Полезно',
    'not_useful_btn': '👎 Не очень',
    'ask_question_btn': '❓ Задать свой вопрос',

    # Прочее
    'help_text': """
📋 Доступные команды:

/start - Запустить бота / Перезапустить
/help  - Справка по работе бота

Используйте кнопки для навигации по меню.
""",
    'get_content': 'Контент доступен по ссылке:\n',
    'rate_content': '📊 Оцените полезность материалов:',
    'rating_positive_feedback': '👍 Спасибо за положительную оценку!',
    'rating_negative_feedback': '👎 Спасибо за обратную связь!',
    'rating_success': 'Спасибо! Ваша оценка сохранена.',
    'enter_question': '📝 Введите ваш вопрос:',
    'send_question_done': """
✅ Ваш вопрос отправлен!
Мы ответим вам в ближайшее время.
""",
    'navigation_hint': '⬇️ Используйте кнопки для навигации:',

    # Типы контента:
    'image_type': '🖼 Изображение',
    'video_type': '🎬 Видео',
    'doc_type': '📄 Документ',
    'unknown_type_content': '📎 Контент',

    # Сообщения бота:
    'echo': """
Я получил ваще сообщение, но не знаю, что с ним делать.
Попробуйте использовать команды /start или /help.
""",
    'unsupported': 'Извините, я не понимаю этот тип сообщений.',

    # Ошибки:
    'error': 'Непредвиденная ошибка.',
    'error_start': 'Ошибка загрузки меню. Попробуйтe /start еще раз.',
    'content_not_found': 'Контент не найден.',
    'rating_error': 'Ошибка при сохранении оценки. Попробуйте позже.',
    'send_question_error': """
❌ Ошибка при отправке вопроса!
Пожалуйста, попробуйте позже.
""",
}
