TEXTS: dict = {
    # Команды:
    'start_command': 'Запустить бота / Перезапустить',
    'help_command': 'Справка по работе бота',
    'help_text': """
📋 Доступные команды:

/start - Запустить бота / Перезапустить
/help  - Справка по работе бота

Используйте кнопки для навигации по меню.
""",

    # Кнопки и прочее:
    'home': '🏠 Главное меню',
    'back': 'Назад',
    'get_content': 'Контент доступен по ссылке:\n',
    'rate_content': '📊 Оцените контент:',
    'rating_success': 'Спасибо! Ваша оценка сохранена.',

    # Типы контента:
    'image_type': '🖼 Изображение',
    'video_type': '🎬 Видео',
    'doc_type': '📄 Документ',
    'unknown_type_content': '📎 Контент',

    # Сообщения бота:
    'echo': """
Я получил ваще сообщение, но не знаю, что с ним делать.
Попробуйте использовать команды /start или /help.
""",
    'unsupported': 'Извините, я не понимаю этот тип сообщений.',

    # Ошибки:
    'error': 'Непредвиденная ошибка.',
    'error_start': 'Ошибка загрузки меню. Попробуйтe /start еще раз.',
    'content_not_found': 'Контент не найден.',
    'rating_error': 'Ошибка при сохранении оценки. Попробуйте позже.',
}
